[
  {
    "subject": "This is a blatant power grab",
    "body": "Shameful. Just shameful… Team, Republicans are conspiring right now to steal the 2026 midterm elections. They know how unpopular their agenda is, especially after passing a budget bill that will hurt millions of families. So instead of trying to win on the issues, they’re changing the rules — making it harder to vote in states across the country and gerrymandering districts to keep themselves in power. They’re hoping we won’t notice — or worse, that we won’t fight back. But we’ve got news for them: We’re not going to let that happen. Democrats are organizing in every state to protect voting rights, fight back against Republican power grabs, and win elections up and down the ballot. But we can’t do it without your help. Can you pitch in $3 or whatever you can afford to help Democrats fight back against these attacks on our democracy and win in 2026? [link removed] Thank you, The Democrats"
  },
  {
    "subject": "NEWS: Virginia GOP Governor Candidate Funded by Known Nazi Sympathizer",
    "body": "Team, news on the key Virginia governor’s race (our only chance to flip a governor's seat this year) — the GOP’s candidate took money from a known Nazi sympathizer. Her campaign claims she didn’t know. But that’s not an excuse — not when we’re talking about someone who wants to be the next governor of Virginia. We’re talking about a person who has supported near-total abortion bans, downplayed the devastating impact of federal layoffs in Virginia, and now, refuses to return campaign donations from someone who has supported a neo-Nazi. There’s no ambiguity here. We can’t afford to let this person become the next governor of Virginia. Democrats have the opportunity to flip this seat — but we need to move fast. Republicans and MAGA groups are already pouring money into this race, and the general election campaign is officially underway. Can you chip in to support the DNC’s work to elect Democrat Abigail Spanberger and organize everywhere we need to win? [link removed] Thank you, The Democrats"
  },
  {
    "subject": "Why this FEC deadline matters:",
    "body": "We're nearly halfway through the month, which means we are nearly halfway to our next FEC deadline — and we're still short of our mid-month goal. Every FEC deadline is a chance to show the strength of our grassroots movement and prove that the Democratic Party has what it takes to win in 2025, 2026, and beyond. But we're not there yet — and if we fall short this time, it will send the wrong message. Here's why this is so important: This week alone, House Republicans advanced legislation that would gut health care and food assistance for tens of millions of Americans. Republicans in the Senate are trying to pass a bill that would make it harder for people to vote. And Donald Trump is continuing to wage war on our democracy, launching attacks on anyone who dares to hold him accountable. That's the future they're fighting for — and we can't afford to let them win. It's up to all of us to fight back, organize everywhere, and elect Democrats who will actually represent the people. If you're with us, we’re asking you to make a contribution to the DNC ahead of our FEC deadline to help us reach our goal and continue building the infrastructure to win. [link removed] Thank you for your support, The Democrats"
  },
  {
    "subject": "Good Morning",
    "body": "Good morning — we hope you won’t scroll past this short read. Over the weekend, Trump and Republicans pushed one of the most extreme budget bills in modern American history — and young people took notice. Their bill would gut our health care system, slash food assistance, cut access to education and job training, eliminate affordable housing support, and put our environment in jeopardy. That’s not speculation. That’s in the bill. It’s no wonder young voters are furious. They turned out in record numbers in 2020, 2022, and again in 2024 to protect health care, climate action, reproductive freedom, and economic opportunity. And Trump and Republicans are attacking all of it. Trump and Republicans are terrified of young people’s power at the ballot box. And they should be. That’s why they’re pushing this reckless bill behind closed doors and spreading lies about what it actually does. But this community sees right through it — and we won’t let it slide. The Democratic Party is already working hard to organize young voters all across the country. If you’re ready to do your part and help fight back against Trump’s attacks on our future, use this link to split a contribution between the DNC and Democratic youth organizing today: [link removed] Thank you, The Democrats"
  },
  {
    "subject": "Why we need your support tonight:",
    "body": "Team, we’re reaching out to ask if you’d make a contribution to the DNC by midnight tonight. Not tomorrow, not next week, but tonight. Here’s the deal: In just shy of six months in office, Trump has: Enacted a disastrous economic agenda that has increased costs for working people and families. Pushed his catastrophic budget bill through Congress (with the help of his GOP allies), which will kick 17 million Americans off their health care and strip families nationwide of access to food assistance. Fired government workers from critical agencies, including from NOAA, NWS, and FEMA, which folks across the country rely on for lifesaving weather advisories ahead of major weather events — and aid in the aftermath. Sowed chaos in California by deploying the National Guard — an unprecedented step that bypassed the authority of Governor Gavin Newsom. Deported folks to a Salvadorian prison without due process, and constructed an inhumane holding center in Florida — ripping apart families and threatening entire communities. Democrats are fighting back. But we have to do more than just resist Trump’s agenda. Here at the DNC, we’re working hard to build the long-term infrastructure we need to get Democrats elected up and down the ballot, all across the country, this year and beyond. If we want to successfully fight back against Trump and his Republican allies, we need to elect leaders who will push back against the administration and work hard to defend their cities, districts, and states. But in order to do that, we need your help tonight. In order to win big across the country and fight back against the GOP agenda, we need to cultivate resources early — the more contributions we receive now, the more effective we can be in the long term, investing in state parties nationwide and organizing millions of voters so that we have the strongest base possible when we need it most. We’re already doing the work to elect Democrats in this year’s New Jersey and Virginia races, and we’ll continue to do the work to flip Congress in 2026 and take back the White House in 2028. So please, use this link to make a donation to the DNC tonight so we can continue to fight for Democrats who will fight for you >> Thank you for standing with us, The Democrats"
  },
  {
    "subject": "Trump’s Unilateral Act of War with Iran",
    "body": "In January — speaking to the entire nation at his Inauguration - Donald Trump proclaimed ‘We will measure our success not only by the battles we win, but also by the wars that we end, and perhaps most importantly, the wars we never get into.’ Today, against his own words, the president sent bombers into Iran. Americans overwhelmingly do not want to go to war. Americans do not want to risk the safety of our troops abroad. Americans do not want a president who bypasses our Constitution and pulls us towards war without Congressional approval. Donald Trump needs to bring his case to Congress immediately. Ken Ken Martin Chair Democratic National Committee"
  },
  {
    "subject": "What happened last week:",
    "body": "Last week, I was physically and aggressively forced out of Secretary of Homeland Security Kristi Noem’s press conference for trying to ask a question. By now, you may have seen the video. Before I even asked my question, I was pushed and pulled, and struggled to maintain my balance. I was forced to the ground first on my knees and then flat on my chest, and as I was handcuffed and marched down a hallway, I repeatedly asked, “Why am I being detained?” I went to that press conference because I was doing my job as a United States Senator — to provide oversight and accountability of the Trump administration. But if you watched what unfolded last week and thought that was about one politician or one press conference, then you’re missing the point. If that’s how this administration responds to a United States senator with a question, what will they do to hardworking Americans raising their voices in California and around the country? If our elected officials become too afraid to speak up, how can we expect any other American to do the same? Right now, Donald Trump would love nothing more than for all of us to just cower away and say nothing, and let him continue to abuse his power. I won’t do that. And I hope you won’t either. If you’re with me, I hope you’ll consider splitting a contribution between my campaign and the DNC. It is more important than ever that we come together and stand against Trump and his allies’ abuse of power. Your donation helps us send that message: Thank you for everything, Alex Padilla U.S. Senator, California"
  },
  {
    "subject": "Abigail Spanberger:",
    "body": "At the DNC, it’s our job to send resources where they’re needed most, when they’re needed most to elect Democrats..."
  },
  {
    "subject": "Skyrocketed:",
    "body": "Last week, we announced that one grassroots supporter and a guest will get to meet President Obama later this summer. And the response was incredible! Since we announced this contest, donations have skyrocketed! Each dot on the map represents someone pitching in not only for their chance to meet President Obama, but to support the DNC’s work organizing around the country. Now’s your chance to join them. Make a contribution of $3, or any amount that feels right today, and you'll be entered into a chance to meet President Obama (travel and hotel expenses paid!) while supporting the DNC’s work to elect Democrats nationwide. Thank you for everything, The Democrats"
  },
  {
    "subject": "re: San Antonio",
    "body": "If you're looking for a way to make an impact right now, we're here to tell you this is it. Let us explain: There’s an important runoff election happening this weekend that’s flying under the radar — but the outcome will directly impact more than one million people in one of the largest cities in our country. In San Antonio, voters are about to head to the polls to elect their next mayor. Republicans are laser-focused on this race, and we need to be, too. One MAGA-aligned group is funding voter contact and advertising efforts targeting San Antonio voters. That makes a big difference — especially in an election that could very well come down to turnout. Texas Democrats need the resources to fight back and reach as many voters in this election and those to come. Can you make a $10 split donation between the Texas Democratic Party and DNC to help elect Democrats up and down the ballot? Republicans are backing a candidate who — as Texas Secretary of State — had to be blocked from handing Texans’ voter registration information over to Trump. It’s clear who he’s working for — and it’s not the people of San Antonio. That’s why it’s so important we win this race, and it’s why we’re committed to investing as much as we can to ensure Democrats have the resources they’ll need in Texas for this election and those to come. We know you may not have opened this email planning to help fund this work, but we hope this explanation helped. If you’re ready to get involved, you can use this link to make a split contribution between the Texas Democratic Party and the DNC. Thank you, The Democrats"
  },
  {
    "subject": "The largest cuts to health care and food assistance in American history",
    "body": "Subject: The largest cuts to health care and food assistance in American history\n\nLast night, House Republicans stayed up all night to continue pushing the largest cuts to health care and food assistance in American history.\n\nIf the House GOP’s budget is passed, 14 million Americans will lose their health care, and a program that 42 million Americans rely on to put food on the table will be at risk.\n\nRepublicans held meetings on this bill in the middle of the night in hopes that the American people wouldn’t notice. But we did.\n\nFor months, Democrats have been sounding the alarm about this bill — holding more than 100 town halls across the country, including in districts where Republicans won’t show up to meet with their own constituents.\n\nAt the same time, it’s more important than ever that we have a Democratic Congress that will actually fight for the people they represent, not take away their basic necessities. We’re committed to competing everywhere and making sure Republicans face the consequences of legislation like this at the ballot box. But to do that, we need your help.\n\nIf our work to elect more Democrats is worth a donation to you and you’re in a position to help fund it, we’re asking you to make that contribution to the DNC today:\n\n[link removed]\n\nDonate to support the DNC’s work to organize everywhere and send a powerful message to Republicans that we’re coming for their jobs in 2026.\n\nDonate to help Democrats win upcoming elections in 2025, 2026, and beyond so we can put more people in office who will check Trump’s power.\n\nDonate because the only way we’ll effectively fight back is if we all come together now.\n\nWe’ve never needed a strong Democratic Party more than we do right now. If you can, please use this link to help support our work.\n\nThank you,\n\nThe Democrats"
  },
  {
    "subject": "Anti-democracy lawmakers are trying to make it harder to vote",
    "body": "Team,\\n\\nLast month, conservatives in the House of Representatives passed the SAVE Act — a bill that would disenfranchise millions of eligible voters by imposing burdensome citizenship requirements at the polls.\\n\\nLet’s be clear: This bill isn’t about election integrity. It’s about voter suppression.\\n\\nRepublicans know their agenda is unpopular. That’s why they’re resorting to dirty tricks like this — to try to silence the voices of millions of Americans, particularly people of color, young voters, and first-time voters.\\n\\nWe must do everything we can to stop this bill from becoming law.\\n\\nWill you rush a $10 donation right now to the DNC to help us fight back against this anti-democratic attack? [link removed]\\n\\nThe SAVE Act is a threat to our democracy. And it’s part of a larger effort by MAGA Republicans to rig our elections in their favor.\\n\\nWe’ve seen it before — in Georgia, in Texas, in Florida, and across the country. But we’ve fought back and won before, too.\\n\\nWith your help, we’ll do it again.\\n\\nThanks for standing with us,\\n\\nThe Democrats"
  },
  {
    "subject": "SIGNATURE NEEDED: Pass the John R. Lewis Voting Rights Act",
    "body": "We won’t lie: We’re terrified by what’s going on in Georgia and across the country under the Republican regime. From extreme voter suppression laws to gerrymandered maps that strip fair representation from voters of color, Republicans have made it clear: They’ll do anything to win — no matter the cost to our democracy.  They’re targeting Georgia in particular because they know how powerful we are. Our movement made Georgia a battleground, elected progressive leaders, and flipped the Senate.  That’s why we must fight back — right here, right now.  Will you split $10 between the Democratic Party of Georgia and the DNC to help us organize, register, and turn out voters in Georgia and across the country?  [link removed]  The new Georgia map is a disaster. Republicans are trying to take away representation from Black voters and consolidate their own power. It’s undemocratic, it’s discriminatory, and it’s exactly what they’re planning in states nationwide.  But we’ve seen what happens when we organize: We win.  So we’re asking — not as party leaders, but as Democrats who care deeply about this country — please split a $10 donation now between the Democratic Party of Georgia and the DNC.  [link removed]  Thank you for your support,  The Democrats"
  },
  {
    "subject": "Urgent: MTG, DOGE, and the House GOP launched a coordinated attack against my work",
    "body": "John,  MTG, DOGE, and House Republicans just launched an all‑out attack on me in a committee hearing.  Here’s what you need to know:  → For years, I’ve worked alongside dozens of leaders to turn Georgia into a battleground, empowering new voters.  → Now, Georgia is purple, and the GOP is terrified. They’re launching baseless accusations to tear me down and undo all the progress we’ve made.  → This attack isn’t just about me — it’s the start of a coordinated Republican plan to take down leaders across the country who are fighting to make a difference and strengthen the right to vote.  But I’m not backing down. I won’t let them stop us, and I need you with me.  Will you chip in to Speak Up PAC today? Your support is critical to keep pushing forward and protecting the work we’ve done for Georgia’s future. (link removed) RUSH $ NOW >> (link removed) RUSH $ NOW >> (link removed) (link removed) RUSH $ NOW >> (link removed) RUSH $ NOW >> (link removed) (link removed) OTHER >> Let’s make sure they don’t succeed.  –Stacey Abrams"
  },
  {
    "subject": "Think I got under his skin?",
    "body": "Schumer here.\\n\\nIt's not every day the president of the United States tells you to \\\"go to hell,\\\" but in this case, from this president, I consider it a badge of honor.\\n\\nLet me explain: Yesterday, President Biden signed the largest investment in climate action in American history. But instead of supporting the bill, Republicans like Trump said Democrats who backed it should \\\"go to hell.\\\"\\n\\nYou know what? If fighting for a cleaner planet, lower costs for working families, and finally taking on Big Pharma is what sends me to hell in Trump's eyes — I'm proud to go there.\\n\\nThis bill is a huge deal. It will lower the cost of prescription drugs, cut health care costs, create millions of good-paying jobs, and reduce our carbon emissions by 40% by the end of the decade. But we only got it done because we have a Democratic Senate, a Democratic House, and a Democratic President.\\n\\nWe must protect and expand our Democratic Senate majority to build on this progress. Will you split a $10 donation between the DSCC and my campaign today? [link removed]\\n\\nThanks for standing with me — even if it means going to hell (according to Trump).\\n\\n— Chuck Schumer"
  },
  {
    "subject": "Trump's \"lock him up\" rhetoric has become real.",
    "body": "Hi John— this is Adam Schiff. The DSCC said I could reach out with this urgent message: Donald Trump just went on Truth Social and called for me to be prosecuted. Why? Because I led his first impeachment. Because I've held him accountable. Because I haven't stopped. And I never will. This is just Trump's latest attempt at political retaliation against his perceived enemies. Donald J. Trump (@realDonaldTrump) via Truth Social: 'I have always suspected Shifty Adam Shiff was a scam artist. And now I learn that Fannie Mae's Financial Crimes Division have concluded that Adam Schiff has engaged in a sustained pattern of possible Mortgage Fraud. Adam Schiff said that his primary residence was in Maryland to get a cheaper mortgage and rip off America, when he must live in California because he was a Congressman from California. I always knew Adam Schiff was a Crook. The fraud began with the refinance of his Maryland property on February 6, 2009, and continued through multiple transactions until the Maryland property was correctly designated as a second home on October 13, 2020. Mortgage Fraud is very serious, and crooked Adam Schiff (now a Senator) needs to be brought to justice.' Over the years, Trump has called for me to be jailed for a variety of reasons, including accusing me of treason. And this latest baseless attempt at political retribution won't stop me from holding him accountable — not by a long shot. I'm not surprised that Trump is lashing out again. But even by his standards, this one's weak. And as much as Trump may hope, this latest smear will not distract from his Epstein files problem. Nevertheless, I need your help right now: rush a split donation between me and the DSCC to help us fight for a Democratic Senate majority that will hold Trump accountable."
  },
  {
    "subject": "HUGE news out of North Carolina!",
    "body": "BREAKING: Roy Cooper is running for Senate in North Carolina! Team, this is absolutely HUGE: Popular former Governor Roy Cooper just announced he is running for Senate in North Carolina, and now we're in a great position to FLIP THIS SEAT! But the GOP is going to pour MILLIONS into keeping this seat red. We need to act NOW to beat them back and deliver a stinging defeat to Republicans. But your gift is missing from our donor records -- and we're running out of time before our EMERGENCY TRIPLE-IMPACT MATCH expires! Please, we need to keep our momentum strong: Chip in $5 (becomes $15) or more immediately to win CRITICAL battleground seats like North Carolina so we can flip the Senate >> We need your help to fight for the Senate. If you've saved your payment info with ActBlue Express, your donation will be processed immediately."
  },
  {
    "subject": "How we stop Trump:",
    "body": "John, Adam Schiff here. It's my honor to serve as California's newest Senator and one of your DSCC Vice Chairs, fighting to flip the Senate blue. In a moment, I'm going to tell you why we must take back the Senate majority to stop Trump's agenda. But first, I need to ask: Will you donate $5 to the DSCC to make it happen? Let me make this as plain as possible: Donald Trump isn't fit to lead. We see it in his actions every day. Pardoning January 6th defendants on his first day in office, cutting Medicaid to pay for massive tax cuts for the wealthiest Americans, attempting to end birthright citizenship, turning his back on our allies -- John, if you invented a fictional politician hellbent on harming our country, they would look exactly like Donald Trump. But how have Senate Republicans responded to this shocking display? With shrugs, and -- more importantly -- votes to let Donald Trump have his way with our government. And that, John, is exactly why we must take back the Senate: Republicans will never stand up to Trump, so if anyone is going to stop this madness and hold him accountable, the responsibility falls to Democrats like us."
  },
  {
    "subject": "An update on what’s happening in Texas",
    "body": "Here's the latest on what's happening in Texas: Trump and his allies are worried about their ability to hold the House majority fair and square, so they’ve attempted to rewrite the rules by gerrymandering Texas’ map, giving Republicans FIVE more congressional seats. Democrats are doing everything they can to stop them. Earlier this week, Texas House Democrats broke quorum, left the state, and stopped the clock on this dangerous gerrymandering attempt. But the fight isn’t over. We have to keep doing everything in our power to stop Trump and Republicans from rigging maps to save themselves in the midterms. Please split $10 between the Texas Democratic Party and the DNC to support our efforts: [link removed] Thousands of Texans showed up to hearings to express opposition to the gerrymandered maps. They see the map for what it is: a textbook case of politicians picking their voters so they can ignore the will of the people. But, this is about more than just one map in one state. It’s about protecting our democracy. And it’s about coming together to stand up to authoritarian tactics everywhere. With your help, we will. Thank you for standing with us on this, The Democrats Don’t click away just yet: Democrats are using every tool available to stop Republicans’ assault on our democracy. Split a $10 contribution between the Texas Democratic Party and the DNC today to keep electing Democrats who will fight for our rights: [link removed] You can unsubscribe from this mailing list at any time: [link removed]"
  },
  {
    "subject": "BREAKING: Trump is targeting young voters",
    "body": "There’s a reason Donald Trump and Republicans are trying so hard to make it harder for young people to vote. And here’s what it comes down to: When young people vote, Democrats win. Gen Z and millennials made up the majority of voters in 2024, and they overwhelmingly supported Democratic candidates. If that trend continues, we can flip the House, protect our Senate majority, and stop Trump’s MAGA agenda — but only if young people can make their voices heard. That’s why Republicans are pushing laws to restrict access to the ballot box for young voters. They’ve passed laws that eliminate campus polling places. They’ve made it harder for students to vote absentee. And now, they’re fighting to close voter registration windows and purge eligible voters from the rolls. That’s not democracy — that’s desperation. Here at the DNC, we’re fighting to defend voting rights and register young voters in all 50 states. But we need your help. We’re asking you to make a donation today to help us register, educate, and turn out more young voters — and stop Trump’s assault on democracy. Because if young people turn out in record numbers again in 2026, we can win big up and down the ballot. Thank you for being a part of this fight. The Democrats"
  }
]